app/controllers/api/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE (user_id = NULL)
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    unless params[:user_id]
      @photos = Photo.all
    else
      @photos = Photo.where("user_id = ?", params[:user_id])

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @photo = Photo.find_by(id: params[:id])

INSERT INTO "photos" ("user_id", "caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 37], ["caption", "I am a new photo1"], ["created_at", "2019-03-04 18:03:50.583311"], ["updated_at", "2019-03-04 18:03:50.583311"]]
---
  def create
    @photo = Photo.new(photo_params)
    if @photo.save

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "photos" SET "caption" = $1, "user_id" = $2, "updated_at" = $3 WHERE "photos"."id" = $4  [["caption", "I am an new photo"], ["user_id", 36], ["updated_at", "2019-03-03 22:57:22.803493"], ["id", 14]]
---
  def update
    @photo = Photo.find_by(id: params[:id])
    unless @photo
      return render json: ["photo not found"], status: 404
    end
    if @photo.update_attributes(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 8]]
---
  def destroy
    @photo = Photo.find_by(id: params[:id])
    unless @photo
      return render json: ["photo not found"], status: 404
    end
    @photo.destroy