app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    # @user.username = user_params[:username]
    # @user.password = user_params[:password]
    # @user.email = user_params[:email]
    # @user.birth_date = user_params[:birth_date]

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"