app/models/user.rb

  def self.find_by_credentials(name, password)
    user = User.find_by(username: name)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Ahmed"], ["LIMIT", 1]]